Repository: AndreaM16/price-probe-ui-v2
Catalog: src/assets/i18n/*.po
Languages: it

source: Details
it: Dettagli

source: Load More
it: Carica Altri

source: Manufacturer:
it: Produttore:

source: No manufacturer found
it: Nessun produttore trovato

source: No title available
it: Titolo non disponibile

source: Score and test size:
it: Punteggio e Dimensione del Test Set:

source: Score not yet calculated
it: Punteggio non ancora calcolato.

source: Search by pid or url . . .
it: Cerca per pid o url . . .

source: Switch Views
it: Vedi altro grafico.

source: Title:
it: Titolo:

source: View on Amazon
it: Vedi su Amazon
